Revit 2024 API
ConduitSizeSettings Class
 Conduit sizes settings
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ConduitSizeSettings : Element,
	IEnumerable<KeyValuePair<string, ConduitSizes>>
Visual Basic
Public Class ConduitSizeSettings _
	Inherits Element _
	Implements IEnumerable(Of KeyValuePair(Of String, ConduitSizes))
Visual C++
public ref class ConduitSizeSettings : public Element,
	IEnumerable<KeyValuePair<String^, ConduitSizes^>>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ConduitSizeSettings
See Also
ConduitSizeSettings Members
Autodesk.Revit.DB.Electrical Namespace